cf/Catalogs/Страницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Страницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>имя файла или каталога</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Блоки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяВТексте</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Страницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Замены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Что</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаЧто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьРегистр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/Страницы/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Перем ИзменилсяЭлемент, ТекЭлемент;

#Область Чтение_запись_данных

&НаСервере
Функция СохранитьРеквизиты(СтраницаСсылка)
	
	Если СтраницаСсылка <> Неопределено Тогда
		
		спрОбъект = СтраницаСсылка.ПолучитьОбъект();
		
		// Реквизиты
		
		спрОбъект.Текст = Текст.ПолучитьТекст();
		
		// Блоки
		
		спрОбъект.Блоки.Очистить();
		Для Каждого Строка Из СтраницыВТексте Цикл ЗаполнитьЗначенияСвойств(спрОбъект.Блоки.Добавить(), Строка) КонецЦикла;
		
		// Замены
		
		спрОбъект.Замены.Очистить();
		Для Каждого Строка Из Замены Цикл ЗаполнитьЗначенияСвойств(спрОбъект.Замены.Добавить(), Строка) КонецЦикла;
		
		Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(спрОбъект); КонецЕсли;
	
КонецФункции
&НаСервере
Процедура ПрочитатьРеквизиты(СтраницаСсылка)
	
	// Реквизиты
	
	Текст.УстановитьТекст(СтраницаСсылка.Текст);
	
	// Блоки
	
	СтраницыВТексте.Очистить();
	Для Каждого Строка Из СтраницаСсылка.Блоки Цикл ЗаполнитьЗначенияСвойств(СтраницыВТексте.Добавить(), Строка) КонецЦикла;
	
	// Замены
	
	Замены.Очистить();
	Для Каждого Строка Из СтраницаСсылка.Замены Цикл ЗаполнитьЗначенияСвойств(Замены.Добавить(), Строка) КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ТекстПриИзменении(Элемент)
	
	ИзменилсяЭлемент = Истина;
	
КонецПроцедуры
&НаКлиенте
Процедура СтраницыВТекстеПриИзменении(Элемент)
	
	ИзменилсяЭлемент = Истина;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаменыПриИзменении(Элемент)
	
	ИзменилсяЭлемент = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИзменилсяЭлемент = Ложь;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если 	ИмяСобытия = "ЗаписанаСтраница" И
			ТекЭлемент = Параметр Тогда
			
		ИзменилсяЭлемент = Ложь;
		ПрочитатьРеквизиты(ТекЭлемент); КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	текСтраница = Элемент.ТекущаяСтрока;
	
	Если ИзменилсяЭлемент Тогда
		Если СохранитьРеквизиты(ТекЭлемент) Тогда
			ИзменилсяЭлемент = Ложь;
		Иначе
			Элемент.ТекущаяСтрока = ТекЭлемент; КонецЕсли; КонецЕсли;
		
	Если текСтраница <> Неопределено Тогда
		ТекЭлемент = текСтраница;
		СписокПриАктивизацииСтрокиНаСервере(текСтраница) КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере(СтраницаСсылка)
	
	ПрочитатьРеквизиты(СтраницаСсылка)
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьРезультат(Команда)
	
	стрОшибки 	= "";
	текСтраница = Элементы.Список.ТекущаяСтрока;
	
	Если текСтраница <> Неопределено Тогда
		
		текТекст = ПолучитьТекст(текСтраница, стрОшибки); 
		
		Если текТекст = Неопределено Тогда ОбщиеФункции.СообщитьТекст(стрОшибки); 
		Иначе
			ТекстДок = Новый ТекстовыйДокумент;
			ТекстДок.УстановитьТекст(текТекст);
			ТекстДок.Показать("Результат " + текСтраница); КонецЕсли; КонецЕсли;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьТекст(Ссылка, стрОшибки)
	
	Возврат Справочники.Страницы.ПолучитьТекст(Ссылка, стрОшибки);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьТекстЗапроса(Команда)
	ПоказатьТекстЗапросаНаСервере(Элементы.Список.ТекущаяСтрока);
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ПоказатьТекстЗапросаНаСервере(Ссылка)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ 
	|	Ссылка,
	|	ЭтоФайл, ЭтоКаталог, Публичный,
	|	ИмяФайла, Текст
	//|	,Блоки.(ИмяВТексте,Страница),
	//|	Замены.(Что, НаЧто, УчитыватьРегистр)
	|ИЗ
	|	Справочник.Страницы
	|ГДЕ
	|	НЕ ПометкаУдаления
	//|	Ссылка В ИЕРАРХИИ(&Ссылка)
	|
	//|УПОРЯДОЧИТЬ ПО Ссылка ИЕРАРХИЯ, Код
	|ИТОГИ ПО Родитель ИЕРАРХИЯ
	
	|");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//   // Получим выборку из результата запроса.
	
	РезультатЗапроса = Запрос.Выполнить();
	СпособВыборки = ОбходРезультатаЗапроса.ПоГруппировкамСИерархией;
   	Выборка = РезультатЗапроса.Выбрать(СпособВыборки);
   	ВыдатьРекурсивно(Выборка);
	
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ВыдатьРекурсивно(Выборка)
   // Пока в выборке есть записи ...
   Пока Выборка.Следующий() Цикл
	   // ... выведем в окно сообщений поля из результата
	   Товар = Выборка.Ссылка;
	   Количество = Выборка.Текст;
	   Сообщить("Ссылка: " + Выборка.Ссылка + " Текст: " + Выборка.Текст);
	   // Продолжим выборку подчиненных записей
	   СпособВыборки = ОбходРезультатаЗапроса.ПоГруппировкамСИерархией;
	   ВыдатьРекурсивно(Выборка.Выбрать(СпособВыборки));
   КонецЦикла;
КонецПроцедуры
